class HomeController < ApplicationController
  def index
    # 検索条件のドロップダウン用のハッシュを作る
    @dates = broadcast_dates
    @areas = broadcast_areas
    @genres = program_genres
  end

  private

  # 放送日のハッシュを作る
  def broadcast_dates
    d = Date.today
    japanese_weekdays = %w[日 月 火 水 木 金 土]
    dates = {'week' => '一週間'}
    7.times do
      dates[d.strftime('%Y-%m-%d')] = d.strftime("%m月%d日(#{japanese_weekdays[d.wday]})")
      d += 1
    end
    dates
  end

  # 放送エリアのハッシュを作る
  def broadcast_areas
    {'010' => '札幌', '011' => '函館', '012' => '旭川', '013' => '帯広', '014' => '釧路', '015' => '北見',
     '016' => '室蘭', '020' => '青森', '030' => '盛岡', '040' => '仙台', '050' => '秋田', '060' => '山形',
     '070' => '福島', '080' => '水戸', '090' => '宇都宮', '100' => '前橋', '110' => 'さいたま',
     '120' => '千葉', '130' => '東京', '140' => '横浜', '150' => '新潟', '160' => '富山', '170' => '金沢',
     '180' => '福井', '190' => '甲府', '200' => '長野', '210' => '岐阜', '220' => '静岡', '230' => '名古屋',
     '240' => '津', '250' => '大津', '260' => '京都', '270' => '大阪', '280' => '神戸', '290' => '奈良',
     '300' => '和歌山', '310' => '鳥取', '320' => '松江', '330' => '岡山', '340' => '広島', '350' => '山口',
     '360' => '徳島', '370' => '高松', '380' => '松山', '390' => '高知', '400' => '福岡', '401' => '北九州',
     '410' => '佐賀', '420' => '長崎', '430' => '熊本', '440' => '大分', '450' => '宮崎', '460' => '鹿児島',
     '470' => '沖縄'}
  end

  # 放送ジャンルのハッシュを作る
  def program_genres
    {'all' => 'すべて', '0000' => 'ニュース', '0001' => '天気予報', '0002' => 'ドキュメンタリー',
     '0003' => '政治', '0004' => '経済', '0005' => '海外', '0006' => 'ニュース分析',
     '0007' => 'ディスカッション', '0008' => '特別レポート', '0009' => 'ローカルプログラム',
     '0010' => 'トラフィックレポート', '0100' => 'スポーツニュース', '0101' => '野球', '0102' => 'サッカー',
     '0103' => 'ゴルフ', '0104' => 'その他の球技', '0105' => '相撲、格闘技', '0106' => '国際大会',
     '0107' => 'マラソン、スポーツ、水泳', '0108' => 'モータースポーツ',
     '0109' => 'マリンスポーツ、ウィンタースポーツ', '0110' => '競馬', '0200' => 'ゴシップ',
     '0201' => 'ファッション', '0202' => '暮らし、住まい', '0203' => '健康、医療', '0204' => 'ショッピング',
     '0205' => 'グルメ、クッキング', '0206' => 'イベント', '0207' => 'プログラムガイド', '0300' => '日本ドラマ',
     '0301' => '海外ドラマ', '0302' => '時代劇', '0400' => '日本のロック、ポップミュージック',
     '0401' => '海外のロック、ポップミュージック', '0402' => 'クラシック、オペラ',
     '0403' => 'ジャズ、フュージョン', '0404' => '人気曲', '0405' => 'ライブコンサート',
     '0406' => '音楽ランキング', '0407' => 'カラオケ、アマチュア歌唱コンテスト',
     '0408' => '日本のバラード、日本の伝統音楽', '0409' => '童謡', '0410' => '民謡、ワールドミュージック',
     '0500' => 'クイズ', '0501' => 'ゲーム', '0502' => 'さまざまな話', '0503' => 'コメディプログラム',
     '0504' => '音楽のバラエティ', '0505' => 'ツアーバラエティ', '0506' => 'コッキングバラエティ',
     '0600' => '海外映画', '0601' => '日本映画', '0602' => 'アニメ', '0700' => '日本アニメ',
     '0701' => '海外アニメ', '0702' => '特殊効果', '0800' => '社会的、現在のイベント',
     '0801' => '歴史、旅行記録', '0802' => '自然、動物、環境', '0803' => '宇宙、科学、医学',
     '0804' => '文化、伝統文化', '0805' => '文学、文学芸術', '0806' => 'スポーツ',
     '0807' => 'トータルドキュメンタリー', '0808' => 'インタビュー、ディスカッション', '0900' => '現代劇、洋劇',
     '0901' => 'ミュージカル', '0902' => 'ダンス、バレエ', '0903' => 'コミックストーリー、エンターテインメント',
     '0904' => '歌舞伎、古典劇', '1000' => '旅行、釣り、アウトドアエンターテインメント',
     '1001' => 'ガーデニング、ペット、手工芸品', '1002' => '音楽、芸術、工芸', '1003' => 'チェス、将棋',
     '1004' => '麻雀、ピンボールゲーム', '1005' => '車、バイク', '1006' => 'コンピューター、テレビゲーム',
     '1007' => '会話、言語', '1008' => '小さな子供たち、学童たち', '1009' => '中学生・高校生',
     '1010' => '大学生、試験', '1011' => '生涯教育、資格', '1100' => '老人', '1101' => '障害者',
     '1102' => '社会福祉', '1103' => 'ボランティア', '1104' => '手話', '1105' => 'テキスト（字幕）',
     '1106' => '音声多重放送の説明'}
  end
end
