class SearchCondition
  # 必要なモジュールをミクスイン
  include ActiveModel::Model
  include ActiveModel::Attributes
  include ActiveModel::Validations

  # カラムの定義
  attribute :days_from_today, :integer, default: 0 # 今日から何日後の番組を検索するか
  attribute :days_count,      :integer, default: 1 # 何日分の番組を検索するか
  attribute :area_code,       :string              # 放送エリアのコード
  attribute :genre_code,      :string              # 番組ジャンルのコード
  attribute :keyword,         :string              # 検索ワード

  # 放送日のハッシュを作る
  def self.broadcast_dates
    d = Time.zone.today
    japanese_weekdays = %w[日 月 火 水 木 金 土]
    dates = {'一週間' => 'week'}

    # 現在の時刻が6時以降か（番組表データは5時頃更新される）
    if Time.zone.now.hour >= 6
      count = 8      # 検索日数
    else
      count = 7
    end

    count.times do |i|
      dates[d.strftime("%m月%d日(#{japanese_weekdays[d.wday]})")] = i
      d += 1
    end
    dates
  end

  # 放送エリアのハッシュを作る
  def self.broadcast_areas
    {"札幌"=>"010","函館"=>"011","旭川"=>"012","帯広"=>"013","釧路"=>"014","北見"=>"015","室蘭"=>"016",
     "青森"=>"020","盛岡"=>"030","仙台"=>"040","秋田"=>"050","山形"=>"060","福島"=>"070","水戸"=>"080",
     "宇都宮"=>"090","前橋"=>"100","さいたま"=>"110","千葉"=>"120","東京"=>"130","横浜"=>"140","新潟"=>"150",
     "富山"=>"160","金沢"=>"170","福井"=>"180","甲府"=>"190","長野"=>"200","岐阜"=>"210","静岡"=>"220",
     "名古屋"=>"230","津"=>"240","大津"=>"250","京都"=>"260","大阪"=>"270","神戸"=>"280","奈良"=>"290",
     "和歌山"=>"300","鳥取"=>"310","松江"=>"320","岡山"=>"330","広島"=>"340","山口"=>"350","徳島"=>"360",
     "高松"=>"370","松山"=>"380","高知"=>"390","福岡"=>"400","北九州"=>"401","佐賀"=>"410","長崎"=>"420",
     "熊本"=>"430","大分"=>"440","宮崎"=>"450","鹿児島"=>"460","沖縄"=>"470"}
  end

  # 放送ジャンルのハッシュを作る
  def self.program_genres
    {"すべて"=>"all","ニュース"=>"0000","天気予報"=>"0001","ドキュメンタリー"=>"0002","政治"=>"0003",
     "経済"=>"0004","海外"=>"0005","スポーツニュース"=>"0100","野球"=>"0101","サッカー"=>"0102","ゴルフ"=>"0103",
     "その他の球技"=>"0104","相撲、格闘技"=>"0105","国際大会"=>"0106","マラソン、スポーツ、水泳"=>"0107",
     "モータースポーツ"=>"0108","マリンスポーツ、ウィンタースポーツ"=>"0109","競馬"=>"0110","ゴシップ"=>"0200",
     "ファッション"=>"0201","暮らし、住まい"=>"0202","健康、医療"=>"0203","ショッピング"=>"0204",
     "グルメ、クッキング"=>"0205","日本ドラマ"=>"0300","海外ドラマ"=>"0301","時代劇"=>"0302",
     "日本のロック、ポップミュージック"=>"0400","海外のロック、ポップミュージック"=>"0401",
     "クラシック、オペラ"=>"0402","ジャズ、フュージョン"=>"0403","人気曲"=>"0404","ライブコンサート"=>"0405",
     "音楽ランキング"=>"0406","カラオケ、アマチュア歌唱コンテスト"=>"0407","日本のバラード、日本の伝統音楽"=>"0408",
     "童謡"=>"0409","民謡、ワールドミュージック"=>"0410","クイズ"=>"0500","ゲーム"=>"0501","コメディ"=>"0503",
     "音楽のバラエティ"=>"0504","ツアーバラエティ"=>"0505","クッキングバラエティ"=>"0506","海外映画"=>"0600",
     "日本映画"=>"0601","アニメ"=>"0602","日本アニメ"=>"0700","海外アニメ"=>"0701","歴史、旅行記録"=>"0801",
     "自然、動物、環境"=>"0802","宇宙、科学、医学"=>"0803","文化、伝統文化"=>"0804","文学、文学芸術"=>"0805",
     "現代劇、洋劇"=>"0900","ミュージカル"=>"0901","ダンス、バレエ"=>"0902","落語"=>"0903",
     "歌舞伎、古典劇"=>"0904","旅行、釣り、アウトドア"=>"1000","ガーデニング、ペット、手工芸品"=>"1001",
     "音楽、芸術、工芸"=>"1002","チェス、将棋"=>"1003","麻雀、ピンボールゲーム"=>"1004","車、バイク"=>"1005",
     "コンピューター、テレビゲーム"=>"1006","会話、言語"=>"1007","小さな子供たち、学童たち"=>"1008",
     "中学生・高校生"=>"1009","大学生、試験"=>"1010","生涯教育、資格"=>"1011","老人"=>"1100","障害者"=>"1101",
     "社会福祉"=>"1102","ボランティア"=>"1103","手話"=>"1104"}
  end

  # カラムのバリデーション
  validates :days_from_today, numericality: { only_integer: true, in: 0..7 }
  validates :area_code, inclusion: { in: broadcast_areas.values }
  validates :genre_code, inclusion: { in: program_genres.values }
end